'''
Games for chat_bot
rock-scissors-paper
guess-the-number
'''

import random

signs = ('rock', 'scissors', 'paper')
stories = ('''Самці виростають до 5,5 м заввишки, тоді як самки досягають близько 4,3 м.
Незважаючи на свою довжину, шия жирафа має лише сім хребців, як і у людини. Кожен хребець має довжину близько 25 см.
У жирафів величезне серце, яке важить близько 11 кг.
Їхні довгі язики, які можуть сягати 45 см завдовжки, допомагають їм харчуватися колючими акаціями.
Два роги на голові жирафа називаються осиконами – це товсті хрящі, вкриті шкірою.''',
'''Африканський саванний слон – найбільший, він сягає 3 м заввишки і важить в середньому до 6 000 кг. 
Навіть слоненята величезні, при народженні вони важать близько 120 кг.
Вуха слонів відрізняються: африканські слони мають більші вуха у формі африканського континенту, 
тоді як вуха азійських слонів нагадують вуха Індійського субконтиненту.
Хобот, високочутливий орган з близько 150 000 м’язових одиниць, служить для різних цілей, 
в тому числі для всмоктування води і використання в якості трубки під час плавання.''',
'''Прообразом першої Барбі була легковажна героїня коміксів для дорослих, популярних у Німеччині п’ятдесятих років минулого століття, 
на ім’я Більд Ліллі. Потім її творці навіть судилися з Mattel за авторські права, але «батьки» Барбі викупили право на виробництво, і випуск Ліллі припинився.
Найдорожчу Барбі продали на аукціоні за 302 500 доларів. В якості прикраси на ній був рожевий діамант в один карат від Стефано Кантур. 
А ось першу ляльку, випущену компанією Mattel, оцінили у 10 тисяч доларів.
Різні організації стверджували, що жінка з параметрами Барбі, які становлять 97/45/82 при зрості 172 см, не змогла б вести повноцінний спосіб життя. 
Але доведено, що жінки із подібними формами народжуються – одна на 100 тисяч. Також деякі красуні йдуть на пластичні операції, щоб набути класичних рис улюбленої ляльки.''')


def rsp():
    '''
    Play rock-scissors-paper
    :return: amount of wins
    '''

    points_rsp_start = 0
    points_rsp_end = 0

    try:
        rounds = int(input('Введіть скільки разів ви б хотіли зіграти: '))
    except ValueError:
        return 'Сталася помилка. Спробуйте наступного разу ввести ціле число.'

    for _ in range(rounds):
        your_sign = input('Введіть камінь (rock), ножиці (scissors) або папір (paper): ').lower()
        rand_sign = signs[random.randint(0, 2)]

        if your_sign in signs:
            points_rsp_start += 1 if your_sign == 'rock' and rand_sign == 'scissors' else 0
            points_rsp_start += 1 if your_sign == 'scissors' and rand_sign == 'paper' else 0
            points_rsp_start += 1 if your_sign == 'paper' and rand_sign == 'rock' else 0
            print(f'Я обрав {rand_sign}')
            print('Ви перемогли!' if points_rsp_start != points_rsp_end else 'Нажаль, ви не перемогли.')
            points_rsp_end = points_rsp_start
        else:
            print('Некоректний знак.')

    return f'Ви перемогли {points_rsp_start}\\{rounds} разів'


def gtn():
    '''
    Play guess-the-number
    :return: number of try
    '''

    try:
        bot_edge = int(input('Введіть нижню межу множини, число з якої ви хочете вгадати: '))
        top_edge = int(input('Введіть верхню межу множини, число з якої ви хочете вгадати: '))
        amount_of_tries = int(input('Введіть скільки спроб ви хочете мати: '))
    except ValueError:
        return 'Сталася помилка. Спробуйте наступного разу ввести ціле число.'

    number_to_guess = random.randint(bot_edge, top_edge)

    for number_of_try in range(amount_of_tries):
        try:
            your_guess = int(input('Спробуйте вгадати число: '))
        except ValueError:
            print('Сталася помилка. Спробуйте ввести ціле число.')
            continue

        if your_guess == number_to_guess:
            return f'Ти вгадав з {number_of_try + 1}-го разу!'

    return f'Ти не вгадав. Загадане число --> {number_to_guess}'


def grs():
    '''
    Get random story
    :return: random story
    '''

    return stories[random.randint(0, 2)]
